-- Пункт 1
-- CREATE TABLE IF NOT EXISTS item(id SERIAL PRIMARY KEY, name VARCHAR(20), describtion VARCHAR(200));

-- Пункт 2
-- INSERT INTO item (id, name, describtion)
-- VALUES
-- 	(1, 'Пхукет', 'Незабываемый отпуск в конченой стране'),
-- 	(2, 'США', 'Вы видели Трампа? Вообще караул!'),
-- 	(3, 'Россия', 'С каждым годом все больше!'),
-- 	(4, 'Китай', 'Долбаные коммуняки'),
-- 	(5, 'Индия', 'А мини мама уля у ляя'),
-- 	(6, 'Пакистан', 'Хотите пушку?'),
-- 	(7, 'Ирландия', 'Я как Томас Шелби...'),
-- 	(8, 'Германия', 'Йа-йа, натюрлих! Фуфелшмерц пакостед карпорэйтед!'),
-- 	(9, 'Беларусь', 'Говорят, в Беларуси закончилась картошка...'),
-- 	(10, 'Италия', 'Город Сеута будет помнить всё...');

-- Подготовка к пункту 3
-- INSERT INTO client (name, birthdate, address)
-- VALUES
-- 	('Антон', '2010-08-23', 'Ульяновск, ул. Юных Ленинцев, д.13'),
--     ('Иван Иванов', '1990-05-14', 'Москва, ул. Ленина, д. 10'),
--     ('Антон Петров', '1995-11-23', 'Санкт-Петербург, Невский пр., д. 45'),
--     ('Мария Сидорова', '1988-03-08', 'Новосибирск, ул. Кирова, д. 12'),
--     ('Алексей Смирнов', '2001-07-19', 'Екатеринбург, ул. Малышева, д. 84'),
--     ('Антон Федоров', '1993-01-30', 'Казань, ул. Баумана, д. 5'),
--     ('Елена Кузнецова', '1997-09-05', 'Нижний Новгород, ул. Горького, д. 22'),
--     ('Дмитрий Попов', '1985-12-12', 'Челябинск, пр. Ленина, д. 61'),
--     ('Ольга Васильева', '1992-04-25', 'Самара, ул. Ново-Садовая, д. 18'),
--     ('Антон Волков', '1999-06-14', 'Ростов-на-Дону, ул. Большая Садовая, д. 33'),
--     ('Анна Соколова', '2004-10-02', 'Красноярск, ул. Маркса, д. 95');

-- Пункт 3. Union
-- SELECT * FROM client
-- WHERE id < 5

-- UNION

-- SELECT * FROM client
-- WHERE name='Антон';
-- Одинокий Антон в моем списке(.... Антон... просто Антон

-- Пункт 4. Union all
-- SELECT * FROM client
-- WHERE id < 5

-- UNION ALL

-- SELECT * FROM client
-- WHERE name='Антон';
-- После UNION ALL сохранился порядок id (с 1-го по 12-ый)

-- Пункт 5. Intersect
-- SELECT * FROM item
-- WHERE id < 3

-- INTERSECT

-- SELECT * FROM item
-- WHERE id < 5;
-- В результате вышли две страны. США и Пхукет, с id=1 и id=2
-- Это закономерный результат вывода пересечения из условия id<3 и id<5. Жестче условие id<3.

-- Пункт 6. Except
-- SELECT * FROM client
-- WHERE id < 10

-- EXCEPT

-- SELECT * FROM client
-- WHERE id > 3;
-- В результате работы операции вычитания из большего (id<10) вычли меньшее (id>3)
-- и получили первые три id клиентов

-- Пункт 7. CROSS JOIN
-- SELECT * FROM (SELECT * FROM client WHERE id < 3) AS c

-- CROSS JOIN

-- (SELECT * FROM item WHERE id <= 2) AS i;
-- Найс. Получилось, что Маша оформляется в Пхукет и США, как и Ваня Иванов

-- Пункт 8. 
SELECT i.name FROM item i;
-- В результате вывелись все уникальные имена товаров

-- Пункт 9.
-- 